import os
from load_icd import load_icd, load_additional_icd, clean
from tqdm import tqdm

with open("train.txt", "r", encoding="utf-8") as f:
    lines = f.readlines()

x_list = []
y_list = []
for line in lines:
    l = line.strip().split("\t")
    x_list.append(clean(l[0]))
    y_list.append(l[1].split("##"))
y_list = [[clean(icd) for icd in y] for y in y_list]

icd2str, match_list = load_icd()
str2standard = load_additional_icd()

print("Check share character")
not_match = set()
for idx, x in enumerate(x_list):
    for y in y_list[idx]:
        #if len(set(x).intersection(set(y))) == 0:
        #    print(x, y)
        if not y in match_list:
            not_match.update([y])

print(not_match)
print(len(not_match))

'''
'输卵管闭锁', '躯干部烫伤', '口腔和咽喉部损伤', '头皮擦伤', '室管膜囊肿', '炎症性肠病', '骨盆部肿瘤',
 '胃粘膜不典型增生', '手坏死', '小细胞-鳞状细胞癌', '溢乳', '腰部占位', '先天性染色体病', '新生儿脑损伤',
  '手部烫伤', '化学药物反应', '皮神经卡压综合征', '韦格纳肉芽肿病[wegenersgranulomatosis病]', 
  '食管粘膜不典型增生', '射频消融术后', '腰椎病', '胸椎小关节功能紊乱', '腋窝肿瘤', '胆囊不典型增生', 
  '先天下颌骨颜面发育不全', '失血性贫血', '颅内出血', '手部肌肉肌腱损伤', '消化道化学伤', '口腔和咽喉部占位', 
  '卵巢多囊样改变', '掌跖角化', '脊柱占位', '皮脂腺囊肿', '食管中上段恶性肿瘤', '低血糖', '腭粘膜炎症', 
  '甲状腺占位', '丙型病毒性肝炎', '趾头炎', '锤状趾', '先天性双侧隐睾', '淀粉样变肝损害', '颅内血肿', 
  '硬膜下出血', '足裂伤', '耳部肿瘤', '指头炎', '下肢肌肉肌腱断裂', '手部关节骨折', '视神经发育不良', 
  '面部占位', '足部肿瘤', '盆腔占位', '多脏器功能障碍综合征[mods]', '胸壁占位', '停经', '肾萎缩', 'o', 
  '牙周炎', '胃粘膜下恒径动脉破裂出血', '会阴部裂伤', '肩颈部劳损', '硬膜外血肿', '硬脊膜下血肿', 
  '神经鞘膜瘤', '手部韧带断裂', '流产', '下肢囊肿', '足部动脉闭塞', '足部关节骨折', 
  '湿疹样癌[佩吉特病][paget病]', '先天性肾发育不良', '孤立性acth缺乏症(iad)', '腰部劳损', '足感染', 
  '绝经', '创伤性硬脑膜外血肿', '急性创伤性硬脊膜下血肿', '椎管占位', 'pci术后', '盆底功能障碍', 
  '被其他哺乳动物咬伤或抓伤,在未特指场所', '抑郁症', '胸部囊肿', '颈部占位', '胸壁肿瘤', '血肿机化', 
  '头部占位', '肠息肉', '手部神经断裂', '臀部肿瘤', '引产', '髋关节骨折', '口腔及咽喉部化学伤', '上肢烫伤', 
  髋部囊肿', '口腔粘膜溃疡', '放射治', '先天性脑膜膨出', '输卵管梗阻', '副肿瘤综合征', '足部囊肿', 
  '创伤性硬脑膜下血肿', '憩室炎', '腕部劳损', '胸椎继发恶性肿瘤', '多发烫伤', '肩部肿瘤', '会阴烫伤', 
  '剑突下疼痛', '急性非创伤性硬脑膜下血肿', '韧带炎', '腕关节骨折', '正中神经断裂', '颈椎小关节紊乱', 
  '高ige综合征', '下肢占位', '癌骨继发恶性肿瘤', '肠占位', '海洛因药物瘾', '血管断裂', '维生素a缺乏干眼症', 
  '癌性疼痛', '肠穿孔', '口腔粘膜白斑病', '炎性假瘤', '背部劳损', 'fsgs[局灶节段性肾小球硬化症]', 
  '肾上腺占位', '截肢', '手部肌肉肌腱断裂', '先天性胰腺异位', '糖原棘皮症', '意识障碍', '硬膜下积液', 
  '扁平足', '灰色皮肤病', '肝细胞不典型增生', '免疫相关性血细胞减少症（irp）', '男性生殖器占位', 
  '蛛网膜下腔血肿', '先天性动静脉畸形', '色素斑', '胸膜占位', '疝', '口腔粘膜恶性肿瘤', '骨盆部囊肿', 
  '室性逸搏性心律', '肾囊肿', '腹腔占位', '肛周肿瘤', '早期人工流产', '骨盆部损伤', '皮肤缺损', '胸部肿瘤',
  回盲部肿瘤', '足恶性肿瘤', '阵发性夜间呼吸困难', '海马硬化[颞叶内侧硬化]', '肝破裂', '乳房占位', 
  '膝关节骨折', '脑血管硬化', '脊柱损伤', '神经断裂', '腰部囊肿', '肌纤维炎', '牙及相关组织损伤', 
  '根尖周炎', '输卵管狭窄', '甲型流感', '足拇外翻', '椎管囊肿', '下肢烫伤', '膝内翻', '心肺复苏术后', 
  '肘部劳损', '接触刀、剑或匕首造成的损伤,在未特指场所', '上气道咳嗽综合征', '鼻窦占位', 
  '宫颈人乳头瘤病毒感染', '咽喉损伤', '膝外翻', '弥漫性进行性脑灰质变性[阿尔珀斯]', '腰部肿瘤', 
  '皮肤挫伤', '骨盆部占位', '硬膜下血肿', '子宫及附件占位', '硬脊膜外血肿', '腹部肿瘤', '睾丸肿瘤',
   '躯干化学伤', '背部占位', '髋关节炎', '足坏死', '盆腔炎', '背部肿瘤', '亚急性创伤性硬脑膜下血肿', 
   '上腔静脉狭窄', '慢性创伤性硬脑膜下血肿', '背部囊肿', '足畸形', '腋窝占位', '胰腺炎', '乳腺纤维瘤',
    '肺纤维化', 'kummell病', '慢性硬膜下血肿', '皮脂腺瘤', '手部肿瘤', '先天性胎儿染色体异常', 
    '宫颈上皮不典型增生', '暴露于未特指类型的辐射下造成的损伤,在未特指场所', '大肠息肉', '性功能障碍',
     '下肢肌肉萎缩', '非创伤性硬脑膜下血肿', '纵隔血肿', '通气功能障碍', '膀胱鳞状上皮化生', '足部烫伤', 
     '胸部占位', '上肢肌肉萎缩', '脊柱畸形', '腹膜占位', '器质性精神障碍', '上肢肌肉肌腱断裂', '肋骨畸形',
      '颈动脉粥样硬化', '胆道不典型增生', '口腔粘膜开放性损伤', '腕关节半脱位'
'''